public class Person {
    String fullName;
    int age;

    public Person() {
        this.fullName = fullName;
        this.age = age;
    }

    public Person(String fullName, int age) {
        this.fullName = fullName;
        this.age = age;
    }

    public static void move() {
        System.out.println("Такой-то Person говорит");
    }

    public static void talk() {
        System.out.println("Такой-то Person говорит");
    }
}


//    Создать класс Person, который содержит:
//
//        переменные fullName, age;
//        методы move() и talk(), в которых просто вывести на консоль сообщение -"Такой-то  Person говорит".
//        Добавьте два конструктора  - Person() и Person(fullName, age).
//        Создайте два объекта этого класса. Один объект инициализируется конструктором Person(), другой
//        - Person(fullName, age).
